In [1]:
import pandas as pd

# Creating two mock datasets
df_passengers = pd.DataFrame({
    'id': [1, 2, 3],
    'name': ['Alice', 'Bob', 'Charlie']
})

df_tickets = pd.DataFrame({
    'id': [1, 2, 4],
    'fare': [100, 200, 300]
})

# Inner Join (Only IDs that exist in BOTH)
inner = pd.merge(df_passengers, df_tickets, on='id', how='inner')

# Left Join (All passengers, even if they have no ticket)
left = pd.merge(df_passengers, df_tickets, on='id', how='left')

# Outer Join (All data from both, fills missing with NaN)
outer = pd.merge(df_passengers, df_tickets, on='id', how='outer')

In [2]:
inner

   id   name  fare
0   1  Alice   100
1   2    Bob   200

In [3]:
left

   id     name   fare
0   1    Alice  100.0
1   2      Bob  200.0
2   3  Charlie    NaN

In [4]:
outer

   id     name   fare
0   1    Alice  100.0
1   2      Bob  200.0
2   3  Charlie    NaN
3   4      NaN  300.0

## Concat

In [5]:
df_2023 = pd.DataFrame({'val': [1, 2]})
df_2024 = pd.DataFrame({'val': [3, 4]})

# Vertical stack (axis=0 is default)
df_all_years = pd.concat([df_2023, df_2024], ignore_index=True)

In [7]:
df_all_years

   val
0    1
1    2
2    3
3    4